garyPenhook/PIC-Assembler/device_includes/pic16f13145.inc
// Register: CM2PCH
#define CM2PCH CM2PCH
CM2PCH                                   equ 0813h
// bitfield definitions
CM2PCH_PCH_POSN                          equ 0000h
CM2PCH_PCH_POSITION                      equ 0000h
CM2PCH_PCH_SIZE                          equ 0003h
CM2PCH_PCH_LENGTH                        equ 0003h
CM2PCH_PCH_MASK                          equ 0007h
CM2PCH_PCH0_POSN                         equ 0000h
CM2PCH_PCH0_POSITION                     equ 0000h
CM2PCH_PCH0_SIZE                         equ 0001h
CM2PCH_PCH0_LENGTH                       equ 0001h
CM2PCH_PCH0_MASK                         equ 0001h
CM2PCH_PCH1_POSN                         equ 0001h
CM2PCH_PCH1_POSITION                     equ 0001h
CM2PCH_PCH1_SIZE                         equ 0001h
CM2PCH_PCH1_LENGTH                       equ 0001h
CM2PCH_PCH1_MASK                         equ 0002h
CM2PCH_PCH2_POSN                         equ 0002h
CM2PCH_PCH2_POSITION                     equ 0002h
CM2PCH_PCH2_SIZE                         equ 0001h
CM2PCH_PCH2_LENGTH                       equ 0001h
CM2PCH_PCH2_MASK                         equ 0004h
CM2PCH_C2PCH0_POSN                       equ 0000h
CM2PCH_C2PCH0_POSITION                   equ 0000h
CM2PCH_C2PCH0_SIZE                       equ 0001h
CM2PCH_C2PCH0_LENGTH                     equ 0001h
CM2PCH_C2PCH0_MASK                       equ 0001h
CM2PCH_C2PCH1_POSN                       equ 0001h
CM2PCH_C2PCH1_POSITION                   equ 0001h
CM2PCH_C2PCH1_SIZE                       equ 0001h
CM2PCH_C2PCH1_LENGTH                     equ 0001h
CM2PCH_C2PCH1_MASK                       equ 0002h
CM2PCH_C2PCH2_POSN                       equ 0002h
CM2PCH_C2PCH2_POSITION                   equ 0002h
CM2PCH_C2PCH2_SIZE                       equ 0001h
CM2PCH_C2PCH2_LENGTH                     equ 0001h
CM2PCH_C2PCH2_MASK                       equ 0004h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 081Fh
// bitfield definitions
CMOUT_C1OUT_POSN                         equ 0000h
CMOUT_C1OUT_POSITION                     equ 0000h
CMOUT_C1OUT_SIZE                         equ 0001h
CMOUT_C1OUT_LENGTH                       equ 0001h
CMOUT_C1OUT_MASK                         equ 0001h
CMOUT_C2OUT_POSN                         equ 0001h
CMOUT_C2OUT_POSITION                     equ 0001h
CMOUT_C2OUT_SIZE                         equ 0001h
CMOUT_C2OUT_LENGTH                       equ 0001h
CMOUT_C2OUT_MASK                         equ 0002h

// Register: PWM1DCL
#define PWM1DCL PWM1DCL
PWM1DCL                                  equ 0820h
// bitfield definitions
PWM1DCL_DCL_POSN                         equ 0006h
PWM1DCL_DCL_POSITION                     equ 0006h
PWM1DCL_DCL_SIZE                         equ 0002h
PWM1DCL_DCL_LENGTH                       equ 0002h
PWM1DCL_DCL_MASK                         equ 00C0h

// Register: PWM1DCH
#define PWM1DCH PWM1DCH
PWM1DCH                                  equ 0821h
// bitfield definitions
PWM1DCH_DCH_POSN                         equ 0000h
PWM1DCH_DCH_POSITION                     equ 0000h
PWM1DCH_DCH_SIZE                         equ 0008h
PWM1DCH_DCH_LENGTH                       equ 0008h
PWM1DCH_DCH_MASK                         equ 00FFh

// Register: PWM1CON
#define PWM1CON PWM1CON
PWM1CON                                  equ 0822h
// bitfield definitions
PWM1CON_POL_POSN                         equ 0004h
PWM1CON_POL_POSITION                     equ 0004h
PWM1CON_POL_SIZE                         equ 0001h
PWM1CON_POL_LENGTH                       equ 0001h
PWM1CON_POL_MASK                         equ 0010h
PWM1CON_OUT_POSN                         equ 0005h
PWM1CON_OUT_POSITION                     equ 0005h
PWM1CON_OUT_SIZE                         equ 0001h
PWM1CON_OUT_LENGTH                       equ 0001h
PWM1CON_OUT_MASK                         equ 0020h
PWM1CON_EN_POSN                          equ 0007h
PWM1CON_EN_POSITION                      equ 0007h
PWM1CON_EN_SIZE                          equ 0001h
PWM1CON_EN_LENGTH                        equ 0001h
PWM1CON_EN_MASK                          equ 0080h
PWM1CON_PWM1POL_POSN                     equ 0004h
PWM1CON_PWM1POL_POSITION                 equ 0004h
PWM1CON_PWM1POL_SIZE                     equ 0001h
PWM1CON_PWM1POL_LENGTH                   equ 0001h
PWM1CON_PWM1POL_MASK                     equ 0010h
PWM1CON_PWM1OUT_POSN                     equ 0005h
PWM1CON_PWM1OUT_POSITION                 equ 0005h
PWM1CON_PWM1OUT_SIZE                     equ 0001h
PWM1CON_PWM1OUT_LENGTH                   equ 0001h
PWM1CON_PWM1OUT_MASK                     equ 0020h
PWM1CON_PWM1EN_POSN                      equ 0007h
PWM1CON_PWM1EN_POSITION                  equ 0007h
PWM1CON_PWM1EN_SIZE                      equ 0001h
PWM1CON_PWM1EN_LENGTH                    equ 0001h
PWM1CON_PWM1EN_MASK                      equ 0080h

// Register: PWM2DCL
#define PWM2DCL PWM2DCL
PWM2DCL                                  equ 0823h
// bitfield definitions
PWM2DCL_DCL_POSN                         equ 0006h
PWM2DCL_DCL_POSITION                     equ 0006h
PWM2DCL_DCL_SIZE                         equ 0002h
PWM2DCL_DCL_LENGTH                       equ 0002h
PWM2DCL_DCL_MASK                         equ 00C0h

// Register: PWM2DCH
#define PWM2DCH PWM2DCH
PWM2DCH                                  equ 0824h
// bitfield definitions
PWM2DCH_DCH_POSN                         equ 0000h
PWM2DCH_DCH_POSITION                     equ 0000h
PWM2DCH_DCH_SIZE                         equ 0008h
PWM2DCH_DCH_LENGTH                       equ 0008h
PWM2DCH_DCH_MASK                         equ 00FFh

// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 0825h
// bitfield definitions
PWM2CON_POL_POSN                         equ 0004h
PWM2CON_POL_POSITION                     equ 0004h
PWM2CON_POL_SIZE                         equ 0001h
PWM2CON_POL_LENGTH                       equ 0001h
PWM2CON_POL_MASK                         equ 0010h
PWM2CON_OUT_POSN                         equ 0005h
PWM2CON_OUT_POSITION                     equ 0005h
PWM2CON_OUT_SIZE                         equ 0001h
PWM2CON_OUT_LENGTH                       equ 0001h
PWM2CON_OUT_MASK                         equ 0020h
PWM2CON_EN_POSN                          equ 0007h
PWM2CON_EN_POSITION                      equ 0007h
PWM2CON_EN_SIZE                          equ 0001h
PWM2CON_EN_LENGTH                        equ 0001h
PWM2CON_EN_MASK                          equ 0080h
PWM2CON_PWM2POL_POSN                     equ 0004h
PWM2CON_PWM2POL_POSITION                 equ 0004h
PWM2CON_PWM2POL_SIZE                     equ 0001h
PWM2CON_PWM2POL_LENGTH                   equ 0001h
PWM2CON_PWM2POL_MASK                     equ 0010h
PWM2CON_PWM2OUT_POSN                     equ 0005h
PWM2CON_PWM2OUT_POSITION                 equ 0005h
PWM2CON_PWM2OUT_SIZE                     equ 0001h
PWM2CON_PWM2OUT_LENGTH                   equ 0001h
PWM2CON_PWM2OUT_MASK                     equ 0020h
PWM2CON_PWM2EN_POSN                      equ 0007h
PWM2CON_PWM2EN_POSITION                  equ 0007h
PWM2CON_PWM2EN_SIZE                      equ 0001h
PWM2CON_PWM2EN_LENGTH                    equ 0001h
PWM2CON_PWM2EN_MASK                      equ 0080h

// Register: PWMTMRS0
#define PWMTMRS0 PWMTMRS0
PWMTMRS0                                 equ 082Fh
// bitfield definitions
PWMTMRS0_P1TSEL_POSN                     equ 0000h
PWMTMRS0_P1TSEL_POSITION                 equ 0000h
PWMTMRS0_P1TSEL_SIZE                     equ 0002h
PWMTMRS0_P1TSEL_LENGTH                   equ 0002h
PWMTMRS0_P1TSEL_MASK                     equ 0003h
PWMTMRS0_P2TSEL_POSN                     equ 0002h
PWMTMRS0_P2TSEL_POSITION                 equ 0002h
PWMTMRS0_P2TSEL_SIZE                     equ 0002h
PWMTMRS0_P2TSEL_LENGTH                   equ 0002h
PWMTMRS0_P2TSEL_MASK                     equ 000Ch

